
## Plan Result




<pre><code>Plan: 1 to add, 7 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string
* Update
  * azurerm_application_insights.appinsights
  * azurerm_key_vault_secret.am_sendgrid_api_key
  * module.vault.azurerm_key_vault.kv
  * module.vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.vault.azurerm_user_assigned_identity.managed_identity[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-shared-infrastructure-aat/providers/Microsoft.Insights/components/am-aat"
        name                                  = "am-aat"
      ~ retention_in_days                     = 30 -> 90
      ~ sampling_percentage                   = 50 -> 100
      ~ tags                                  = {
          + "builtFrom"    = "https://github.com/hmcts/am-shared-infrastructure"
          + "expiresAfter" = "3000-01-01"
          - "managedBy"    = "AM" -> null
          ~ "team_contact" = "#accessmanagement-support" -> "#am-team"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.am_sendgrid_api_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "am_sendgrid_api_key" {
        id                      = "https://am-aat.vault.azure.net/secrets/am-sendgrid-api-key/b0f7c82e4d28495ab2965846c14a7f32"
        name                    = "am-sendgrid-api-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/am-aat"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/am-aat"
        name                            = "am-aat"
      ~ purge_protection_enabled        = false -> true
      ~ tags                            = {
          + "application"  = "access-management"
          + "builtFrom"    = "https://github.com/hmcts/am-shared-infrastructure"
          + "businessArea" = "CFT"
          + "expiresAfter" = "3000-01-01"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/am-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (7 unchanged elements hidden)
            "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
        ]
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            # (10 unchanged elements hidden)
            "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/am-aat/objectId/3e235565-1054-4b83-86c1-318d05dd4342"
      ~ key_permissions         = [
            # (4 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
      ~ secret_permissions      = [
            # (2 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/am-aat|am-aat"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "am-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/am-shared-aat-mi"
        name                = "am-shared-aat-mi"
      ~ tags                = {
          + "application"  = "access-management"
          + "builtFrom"    = "https://github.com/hmcts/am-shared-infrastructure"
          + "businessArea" = "CFT"
          + "expiresAfter" = "3000-01-01"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 7 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":51,"Program":"tfcmt","SHA1":"","Vars":{}} -->